[{"_id":{"$oid":"5d2f049bb0a5987f797660ff"},"name":"Ackbar","role":"General","alliance":"Rebel Alliance","species":"Mon Calamari","gender":"male","height":{"$numberDouble":"1.8"},"weapon":"blaster pistol","homeworld":"Mon Cala","bio":"A veteran commander, Ackbar led the defense of his homeworld, Mon Cala, during the Clone Wars and then masterminded the rebel attack on the second Death Star at the Battle of Endor. Ackbar realized the rebels had been drawn into a trap at Endor, but adjusted, with his fleet buying valuable time for the attack to succeed. After the Battle of Endor, Ackbar became a Grand Admiral in the New Republic, winning many victories including the pivotal Battle of Jakku. He retired to Mon Cala, but was coaxed back into service with the Resistance by Leia Organa.","image":"ackbar.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766104"},"name":"BB-8","role":"Astromech Droid","alliance":"Resistance","species":"droid","height":{"$numberDouble":"0.67"},"bio":"A skittish but loyal astromech, BB-8 accompanied Poe Dameron on many missions for the Resistance, helping keep his X-wing in working order. When Poe’s mission to Jakku ended with his capture by the First Order, BB-8 fled into the desert with a vital clue to the location of Jedi Master Luke Skywalker.","image":"bb8.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766109"},"name":"C-3PO","role":"Protocol Droid","species":"Droid","height":{"$numberDouble":"1.71"},"homeworld":"Tatooine","alliance":"Rebel Alliance","bio":"Created with discarded scrap metal and parts by a young Anakin Skywalker on Tatooine, C-3PO was originally made to help Anakin's mother Shmi with household chores. Threepio would later meet his lifelong droid friend R2-D2 when Anakin befriended Padmé Amidala. Threepio and Artoo would pair up again for many adventures, although the protocol droid dreaded danger and would much rather focus on etiquette and diplomacy. Threepio would later serve useful as a translator for not only Padmé in negotiations during the Clone Wars, but also much later for other human companions Princess Leia and Luke Skywalker. The protocol droid's talent for communicating in other languages comes in handy when delegating with Jabba the Hutt, the Talz, and Ewoks.","image":"c3po.png"},
{"_id":{"$oid":"5d2f049bb0a5987f7976610e"},"name":"Cassian Jeron Andor","role":"soldier","alliance":"Rebel Alliance","species":"Human","gender":"male","height":{"$numberDouble":"1.78"},"weapon":"blaster pistol","homeworld":"Fest","bio":"An accomplished Alliance Intelligence officer with combat field experience, Captain Cassian Andor commands respect from his Rebel troops with his ability to keep a cool head under fire and complete his missions with minimal resources.","image":"cassianandor.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766113"},"name":"Chewbacca","role":"Warrior","alliance":"Rebel Alliance","species":"Wookie","gender":"male","height":{"$numberDouble":"2.28"},"weapon":"Bowcaster","homeworld":"Kashyyyk","bio":"A legendary Wookiee warrior and Han Solo’s co-pilot aboard the Millennium Falcon, Chewbacca was part of a core group of Rebels who restored freedom to the galaxy. Known for his short temper and accuracy with a bowcaster, Chewie also has a big heart -- and is unwavering in his loyalty to his friends. He has stuck with Han through years of turmoil that have changed both the galaxy and their lives.","image":"chewbacca.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766118"},"name":"Darth Sidious","role":"Sith Lord","species":"Human","gender":"male","height":{"$numberDouble":"1.78"},"weapon":"lightsaber","homeworld":"Naboo","alliance":"Galactic Empire","bio":"Darth Sidious is the name assumed by Palpatine when he became a Sith Lord. In time, the Sith identity became more real than Palpatine's public face. After the Clone Wars and his ascension to Emperor, Palpatine essentially lived as Sidious for the remainder of his life.","image":"darthsidious.png"},
{"_id":{"$oid":"5d2f049bb0a5987f7976611d"},"name":"Darth Vader","role":"Sith Lord","species":"Human","gender":"Male","height":{"$numberDouble":"2.03"},"weapon":"lightsaber","homeworld":"Tatooine","alliance":"Galactic Empire","bio":"Once a Jedi Knight, Anakin Skywalker swore loyalty to Sith Lord Darth Sidious in order to gain the power of the dark side of the Force. Vader betrayed the Jedi Order and his Master, Obi-Wan Kenobi. With the rise of the Galactic Empire, Darth Vader became the Emperor's dark enforcer. He carried out the Emperor's will, and commanded legions of Imperial troops. Vader was tasked with discovering the secret headquarters of the Rebel Alliance, as well as chasing down the Rebels who destroyed the Empire's massive Death Star battle station. Darth Vader was encased in sinister black armor. The man underneath was mortally wounded in a lightsaber duel, and the dark suit includes extensive machinery to keep Vader alive. The sounds of his mechanical lungs accompany his every step. Such injuries greatly diminished his ability to use the Force, but Vader is still very powerful. He can command the power of the dark side to hurl objects or remotely crush the throats of his victims.","image":"darthvader.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766122"},"name":"Finn","role":"Stormtrooper","alliance":"The First Order","species":"human","gender":"male","height":{"$numberDouble":"1.78"},"weapon":"blaster rifle","homeworld":"Unknown","bio":"FN-2187 was trained since birth to serve the First Order as a stormtrooper, but a skirmish on Jakku awakened his conscience and drove him down a different path, one that proved both heroic and dangerous. He helped Poe Dameron escape the First Order – picking up the nickname Finn in doing so – and then sought his own freedom alongside Rey and BB-8.","image":"finn.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766127"},"name":"Han Solo","role":"Scoundrel","species":"Human","gender":"Male","height":{"$numberDouble":"1.8"},"weapon":"blaster pistol","homeworld":"Corellia","alliance":"Rebel Alliance","bio":"An outlaw smuggler with a heart of gold, Han Solo proved his heroism after he got mixed up with the Rebel Alliance in their fight against the Empire. Han and his co-pilot Chewbacca flew the freighter Millennium Falcon to help the Rebels destroy the Death Star, but when Jabba the Hutt placed a price on his head, he was frozen in a carbonite slab and hung in Jabba's palace. His friends, including Luke Skywalker, Princess Leia, and Lando Calrissian, rescued Han in time for him to lead the ground attack that led to a Rebel triumph in the Battle of Endor.","image":"hansolo.png"},
{"_id":{"$oid":"5d2f049bb0a5987f7976612c"},"name":"Hux","role":"General","alliance":"The First Order","species":"Human","gender":"male","height":{"$numberDouble":"1.85"},"weapon":"blaster pistol","homeworld":"Arkanis","bio":"A young, ruthless officer in the First Order, General Hux has complete confidence in his troops, training methods and weapons. A rival of Kylo Ren’s, Hux eagerly awaits the day when the First Order will bring down the hated New Republic, and considers it his destiny to rule the galaxy.","image":"hux.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766131"},"name":"Jyn Erso","role":"soldier","alliance":"Rebel Alliance","species":"Human","gender":"female","height":{"$numberDouble":"1.6"},"weapon":"blaster pistol","homeworld":"Vallt","bio":"Putting behind a checkered past by lending her skills to a greater cause, Jyn Erso is impetuous, defiant, and eager to bring the battle to the Empire. Used to operating alone, she finds higher purpose by taking on a desperate mission for the Rebel Alliance.","image":"jynerso.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766136"},"name":"Kylo Ren","role":"Jedi","alliance":"The First Order","species":"Human","gender":"male","height":{"$numberDouble":"1.89"},"weapon":"lightsaber","homeworld":"Unknown","bio":"A dark warrior strong with the Force, Kylo Ren commands First Order missions with a temper as fiery as his unconventional lightsaber. As a leader of the First Order and a student of Supreme Leader Snoke, he seeks to destroy the New Republic, the Resistance and the legacy of the Jedi.","image":"kyloren.png"},
{"_id":{"$oid":"5d2f049bb0a5987f7976613b"},"name":"Lando Calrissian","role":"Scoundrel","species":"Human","gender":"Male","height":{"$numberDouble":"1.78"},"weapon":"blaster pistol","homeworld":"Socorro","alliance":"Rebel Alliance","bio":"Card player, gambler, scoundrel... Lando Calrissian preferred to operate outside the jurisdiction of the Empire. As administrator of Cloud City, a Tibanna gas mining facility hovering in the atmosphere of the planet Bespin, Lando welcomes his old friend Han Solo along with Leia, Chewbacca, Artoo and Threepio after their harrowing escape from the Empire on Hoth. But not all was what it seemed -- Lando had in fact made a deal with Darth Vader to capture the unfortunate Captain Solo in exchange for the security of Cloud City and its people. It was a deal Calrissian was set up to lose. With Solo captured, frozen in carbonite, and taken to the vile gangster Jabba the Hutt, Lando recognized the gravity of his betrayal and seized the initiative to redeem himself. After freeing Solo's friends and warning Cloud City's residents of the impending Imperial takeover, he fled with Leia and the others to the Rebel Alliance where he helped mount Han Solo's rescue from Jabba the Hutt. Later, as a general in the Alliance, Calrissian led a starfighter attack which resulted in the destruction of the Empire's second Death Star.","image":"landocalrissian.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766140"},"name":"Leia Organa","role":"Rebel Leader","species":"Human","gender":"Female","height":{"$numberDouble":"1.5"},"weapon":"blaster pistol","homeworld":"Alderaan","alliance":"Rebel Alliance","bio":"Separated from a mother she barely knew and a father she later counted among her worst enemies, Leia Organa is a princess who grew up enmeshed in the politics of her time. She accomplished much by a young age: a leader in the Rebel Alliance, a former member of the Imperial Senate, and a member of the Royal Family of Alderaan. She never desired the power that was thrust upon her, but so strong was her commitment to peace, freedom, and democracy that she was willing to accept the burdens and the risks that it took to accomplish her goals.","image":"leiaorgana.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766145"},"name":"Lorth Needa","role":"Fleet Officer","alliance":"Galactic Empire","height":{"$numberDouble":"1.75"},"weapon":"blaster Pistol","species":"Human","homeworld":"Coruscant","gender":"male","bio":"Captain Needa commanded the Avenger, one of the Imperial Star Destroyers that fought for the Empire at the Battle of Hoth. His ship pursued the fleeing Millennium Falcon, but the freighter escaped under mysterious circumstances. Baffled but contrite, Needa decided it was his duty to apologize to Darth Vader for losing the ship.","image":"lorthneeda.png"},
{"_id":{"$oid":"5d2f049bb0a5987f7976614a"},"name":"Luke Skywalker","role":"Jedi","species":"Human","gender":"Male","height":{"$numberDouble":"1.72"},"weapon":"lightsaber","homeworld":"Tatooine","alliance":"Rebel Alliance","bio":"Raised as a farmboy on the backwater desert world of Tatooine, Luke had no idea that he was the secret son of Anakin Skywalker, the Chosen One born to bring balance to the Force. After his stepparents were murdered by the Empire, he destroyed the Death Star and became the Rebellion's greatest hero. But Luke's true destiny lay with the Jedi Order. He learned the ways of the Force from Obi-Wan Kenobi and Yoda, and discovered the terrible secret of his parentage. Luke insisted there was still good in Darth Vader, and his love for his father reawakened Anakin's spirit, inspiring him to sacrifice himself to destroy Darth Sidious.","image":"lukeskywalker.png"},
{"_id":{"$oid":"5d2f049bb0a5987f7976614f"},"name":"Mace Windu","role":"Jedi","height":{"$numberDouble":"1.92"},"weapon":"lightsaber","homeworld":"Haruun Kal","species":"Human","gender":"male","alliance":"Rebel Alliance","bio":"A grim Jedi Master with an amethyst-bladed lightsaber, Mace Windu was the champion of the Jedi Order, with little tolerance for the failings of the Senate, the arguments of politicians or the opinions of rebellious Jedi. As the Clone Wars intensified, Mace sensed the dark side of the Force at work, and knew the Jedi's enemies were plotting to destroy the Order and end its stewardship of the galaxy.","image":"macewindu.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766154"},"name":"Maximilian Veers","role":"Major General","alliance":"Galactic Empire","height":{"$numberDouble":"1.93"},"weapon":"blaster Pistol","gender":"male","species":"Human","homeworld":"Denon","bio":"A cool and efficient officer, General Veers led the Imperial assault on Hoth, marching his AT-AT walkers across the planet's frozen plains and destroying the massive generators powering the Rebel base's protective energy shield.","image":"maximilianveers.png"},
{"_id":{"$oid":"5d2f049bb0a5987f79766159"},"name":"Obi-Wan Kenobi","role":"Jedi","species":"Human","gender":"Male","height":{"$numberDouble":"1.82"},"weapon":"lightsaber","homeworld":"Stewjon","alliance":"Rebel Alliance","bio":"Also known as the 'Negotiator', Obi-Wan Kenobi kept a cool head in the thick of combat. Obi-Wan was never at a loss for a quick word of wisdom or humor. He served as a General in the Repulic's army, with Clone Commander Cody often at his side. For over a decade Obi-Wan guided young Anakin Skywalker on the path to Jedi Knighthood. Having to rein in an adventure-seeking youth made Obi-Wan wise -- and cynical -- beyond his years. True to his role, Obi-Wan recognized both Anakin's strengths and weaknesses, and he tried to impart his lessons with the patience and understanding that his mentor, Qui-Gon, did. Following the tragedy of the Clone Wars, and the rise of the Galactic Empire, Obi-Wan was one of the few Jedi survivors. He hid on Tatooine, living in exile while keeping a watchful eye over Luke Skywalker, Anakin's son who was also strong in the Force.","image":"obiwankenobi.png"},
{"_id":{"$oid":"5d2f049cb0a5987f7976615e"},"name":"Orson Callan Krennic","role":"Lieutenant Commander","alliance":"Galactic Empire","species":"human","gender":"male","height":{"$numberDouble":"1.8"},"weapon":"blaster pistol","homeworld":"Lexrul","bio":"As director of Advanced Weapons Research for the Imperial military, Orson Krennic is obsessed with the completion of the long-delayed Death Star project. A cruel but brilliant man, Krennic has staked his reputation on the delivery of the functional battle station to the Emperor.","image":"orsonkrennic.png"},
{"_id":{"$oid":"5d2f049cb0a5987f79766164"},"name":"Padme Amidala","role":"Senator","alliance":"Rebel Alliance","species":"Human","gender":"female","height":{"$numberDouble":"1.65"},"weapon":"blaster pistol","homeworld":"Naboo","bio":"An idealist during a time of corruption and war in the Republic, Padmé Amidala was determined to fix what wrongs she could in the Senate, where she represented her idyllic home planet of Naboo. Despite her busy career, Padmé found time for a secret, forbidden marriage with Anakin Skywalker, the Jedi hero of the Clone Wars. Though not a soldier, Padmé nonetheless found herself often in the thick of danger as she courageously defended her deepest held beliefs.","image":"padmeamidala.png"},
{"_id":{"$oid":"5d2f049cb0a5987f79766169"},"name":"Phasma","role":"Captain","alliance":"The First Order","species":"Human","gender":"female","height":{"$numberInt":"2"},"weapon":"blaster rifle","homeworld":"Unknown","bio":"Clad in distinctive armor of salvaged chromium, Captain Phasma commands the First Order’s legions of stormtroopers. A tough veteran commander, she has no use for fancy titles or complex war rooms, preferring to lead her troops in battle against the First Order’s enemies.","image":"phasma.png"},
{"_id":{"$oid":"5d2f049cb0a5987f7976616e"},"name":"Poe Dameron","role":"Pilot","alliance":"Resistance","species":"human","gender":"male","height":{"$numberDouble":"1.7"},"weapon":"blaster pistol","homeworld":"Yavin 4","bio":"Poe Dameron is a commander in the Resistance’s Starfighter Corps and one of Leia Organa’s most-trusted operatives. The son of a rebel fighter pilot and a rebel commando, Poe grew up on stories of Alliance campaigns. A decorated X-wing pilot, he can fly anything – which is fortunate given how often his headstrong nature leads him into trouble.","image":"poedameron.png"},
{"_id":{"$oid":"5d2f049cb0a5987f79766173"},"name":"R2-D2","role":"Astromech Droid","species":"droid","height":{"$numberDouble":"1.09"},"weapon":"Electro-shock prod","homeworld":"Naboo","alliance":"Rebel Alliance","bio":"A resourceful astromech droid, R2-D2 served Padmé Amidala, Anakin Skywalker and Luke Skywalker in turn, showing great bravery in rescuing his masters and their friends from many perils. A skilled starship mechanic and fighter pilot's assistant, he formed an unlikely but enduring friendship with the fussy protocol droid C-3PO.  R2-D2's mechanical body contains numerous arms tipped with all manner of useful tools, from welding torches to computer interfaces. Like other astromechs, his language is a cacophony of beeps and whistles understandable only by some other droids. But the spunky little droid's abundant personality generally makes his meaning plain enough.","image":"r2d2.png"},
{"_id":{"$oid":"5d2f049cb0a5987f79766178"},"name":"Rey","role":"Scavenger","alliance":"Resistance","species":"human","gender":"female","height":{"$numberDouble":"1.7"},"weapon":"blaster pistol","homeworld":"Jakku","bio":"Rey is a Jakku scavenger, a survivor toughened by life on a harsh desert planet. When the fugitive droid BB-8 appeals to her for help, Rey finds herself drawn into a galaxy-spanning conflict. Despite dismissing herself as “no one,” she learns that her life is being shaped by the mysterious power of the Force.","image":"rey.png"},
{"_id":{"$oid":"5d2f049cb0a5987f7976617d"},"name":"Snoke","role":"Jedi","alliance":"The First Order","species":"Human","gender":"male","height":{"$numberDouble":"2.13"},"weapon":"lightsaber","homeworld":"Unknown","bio":"The Supreme Leader of the First Order, the mysterious Snoke has no permanent base of operations, preferring to contact his underlings from a mobile command post. Snoke is powerful with the dark side of the Force, and seduced Kylo Ren into abandoning the Jedi path to become his apprentice. But Snoke also commands General Hux and the technological war machine the First Order has engineered to destroy the New Republic and Leia Organa’s Resistance.","image":"snoke.png"},
{"_id":{"$oid":"5d2f049cb0a5987f79766182"},"name":"Tarkin","role":"Grand Moff","species":"human","height":{"$numberDouble":"1.85"},"homeworld":"Eriadul","alliance":"Galactic Empire","gender":"male","bio":"An ambitious, ruthless proponent of military power, Wilhuff Tarkin became a favorite of Supreme Chancellor Palpatine and rose rapidly through the Imperial ranks. Shortly after the Empire's creation, he was put in charge of the construction of the Death Star. Tarkin saw the Death Star as a way to crush all dissent to the Empire's rule -- fear of the station's planet-killing superlaser would keep the galaxy's star systems in line. He demonstrated the station's power by destroying Alderaan, but died soon afterwards when the Death Star itself was destroyed.","image":"tarkin.png"},
{"_id":{"$oid":"5d2f049cb0a5987f79766187"},"name":"Yoda","role":"Jedi","alliance":"Rebel Alliance","species":"Unknown","gender":"male","height":{"$numberDouble":"0.66"},"weapon":"lightsaber","homeworld":"Unknown","bio":"Yoda was a legendary Jedi Master and stronger than most in his connection with the Force. Small in size but wise and powerful, he trained Jedi for over 800 years, playing integral roles in the Clone Wars, the instruction of Luke Skywalker, and unlocking the path to immortality.","image":"yoda.png"}]